Microchip-MPLAB-Harmony/reference_apps/apps/pic32ck_sg01_cult/pic32ck_sg01_cult_tz_getting_started/firmware/src/packs/PIC32CK2051SG01144_DFP/component/sercom.h
/* -------- SERCOM_I2CM_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) I2CM FIFO CPU Pointers -------- */
#define SERCOM_I2CM_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_I2CM_FIFOPTR) I2CM FIFO CPU Pointers  Reset Value */

#define SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_I2CM_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_I2CM_FIFOPTR_CPUWRPTR(value)   (SERCOM_I2CM_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_I2CM_FIFOPTR register */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_I2CM_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_I2CM_FIFOPTR_CPURDPTR(value)   (SERCOM_I2CM_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_I2CM_FIFOPTR register */
#define SERCOM_I2CM_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_I2CM_FIFOPTR) Register Mask  */


/* -------- SERCOM_I2CS_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) I2CS FIFO CPU Pointers -------- */
#define SERCOM_I2CS_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_I2CS_FIFOPTR) I2CS FIFO CPU Pointers  Reset Value */

#define SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_I2CS_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_I2CS_FIFOPTR_CPUWRPTR(value)   (SERCOM_I2CS_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_I2CS_FIFOPTR register */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_I2CS_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_I2CS_FIFOPTR_CPURDPTR(value)   (SERCOM_I2CS_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_I2CS_FIFOPTR register */
#define SERCOM_I2CS_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_I2CS_FIFOPTR) Register Mask  */


/* -------- SERCOM_SPIM_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) SPIM FIFO CPU Pointers -------- */
#define SERCOM_SPIM_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_SPIM_FIFOPTR) SPIM FIFO CPU Pointers  Reset Value */

#define SERCOM_SPIM_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_SPIM_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_SPIM_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_SPIM_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_SPIM_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_SPIM_FIFOPTR_CPUWRPTR(value)   (SERCOM_SPIM_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_SPIM_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_SPIM_FIFOPTR register */
#define SERCOM_SPIM_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_SPIM_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_SPIM_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_SPIM_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_SPIM_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_SPIM_FIFOPTR_CPURDPTR(value)   (SERCOM_SPIM_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_SPIM_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_SPIM_FIFOPTR register */
#define SERCOM_SPIM_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_SPIM_FIFOPTR) Register Mask  */


/* -------- SERCOM_SPIS_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) SPIS FIFO CPU Pointers -------- */
#define SERCOM_SPIS_FIFOPTR_RESETVALUE        _UINT16_(0x00)                                       /*  (SERCOM_SPIS_FIFOPTR) SPIS FIFO CPU Pointers  Reset Value */

#define SERCOM_SPIS_FIFOPTR_CPUWRPTR_Pos      _UINT16_(0)                                          /* (SERCOM_SPIS_FIFOPTR) CPU FIFO Write Pointer Position */
#define SERCOM_SPIS_FIFOPTR_CPUWRPTR_Msk      (_UINT16_(0xF) << SERCOM_SPIS_FIFOPTR_CPUWRPTR_Pos)  /* (SERCOM_SPIS_FIFOPTR) CPU FIFO Write Pointer Mask */
#define SERCOM_SPIS_FIFOPTR_CPUWRPTR(value)   (SERCOM_SPIS_FIFOPTR_CPUWRPTR_Msk & (_UINT16_(value) << SERCOM_SPIS_FIFOPTR_CPUWRPTR_Pos)) /* Assigment of value for CPUWRPTR in the SERCOM_SPIS_FIFOPTR register */
#define SERCOM_SPIS_FIFOPTR_CPURDPTR_Pos      _UINT16_(8)                                          /* (SERCOM_SPIS_FIFOPTR) CPU FIFO Read Pointer Position */
#define SERCOM_SPIS_FIFOPTR_CPURDPTR_Msk      (_UINT16_(0xF) << SERCOM_SPIS_FIFOPTR_CPURDPTR_Pos)  /* (SERCOM_SPIS_FIFOPTR) CPU FIFO Read Pointer Mask */
#define SERCOM_SPIS_FIFOPTR_CPURDPTR(value)   (SERCOM_SPIS_FIFOPTR_CPURDPTR_Msk & (_UINT16_(value) << SERCOM_SPIS_FIFOPTR_CPURDPTR_Pos)) /* Assigment of value for CPURDPTR in the SERCOM_SPIS_FIFOPTR register */
#define SERCOM_SPIS_FIFOPTR_Msk               _UINT16_(0x0F0F)                                     /* (SERCOM_SPIS_FIFOPTR) Register Mask  */


/* -------- SERCOM_USART_INT_FIFOPTR : (SERCOM Offset: 0x36) (R/W 16) USART FIFO CPU Pointers -------- */
#define SERCOM_USART_INT_FIFOPTR_RESETVALUE   _UINT16_(0x00)                                       /*  (SERCOM_USART_INT_FIFOPTR) USART FIFO CPU Pointers  Reset Value */

